卡西乌斯_攻击1                         = 10000
卡西乌斯_攻击2                         = 10001
卡西乌斯_攻击3                         = 10002
卡西乌斯_攻击4                         = 10003
卡西乌斯_攻击5                         = 10008
卡西乌斯_攻击7                         = 10011
卡西乌斯_攻击6                         = 10005

卡西乌斯_蓄力                          = 10006
卡西乌斯_魔法施放                      = 10004

卡西乌斯_百烈击                        = 10010
卡西乌斯_百烈击2                       = 10014
卡西乌斯_音效_百烈击                    = 10026

卡西乌斯_钢盔断_起跳                    = 10007

卡西乌斯_YAREYARE                      = 10020

卡西乌斯_死亡1                         = 10021
卡西乌斯_死亡2                         = 10024

卡西乌斯_防御                          = 10025

卡西乌斯_万象天引                       = 10033
卡西乌斯_神罗天征                       = 10034
卡西乌斯_神罗天征_ここより世界に痛みを       = 10035
卡西乌斯_神罗天征_ここより                 = 10036
卡西乌斯_神罗天征_世界に痛みを            = 10037

卡西乌斯_音效_普通攻击                  = 10027
卡西乌斯_音效_百烈击_结尾               = 10028

卡西乌斯_音效_雷光击_旋转               = 10029
卡西乌斯_音效_雷光击_起跳               = 10030
卡西乌斯_音效_雷光击_移动               = 10031
卡西乌斯_音效_雷光击_击中               = 10032
卡西乌斯_音效_雷光击_现身               = 250

卡西乌斯_音效_钢盔断_起跳                = 844

# ed7s0328.wav
